# recipe.py
RECIPE = {
    "反物质": {
        0: {"临界光子": 1},
    },
    "铁块": {
        0: {"铁矿": 1},
    },
    "铜块": {
        0: {"铜矿": 1},
    },
    "石材":{
        0: {"石矿": 1},
    },
    "石墨": {
        0: {"煤矿": 2}
    },
    "硅块": {
        0: {"硅矿": 2}
    },
    "钛块": {
        0: {"钛矿": 2},
    },
    "精炼油": {
        0: {"原油": 1}
    },
    "磁铁": {
        0: {"铁矿": 1},   
    },
    "线圈": {
        0: {"铜块": 1, "磁铁": 2},
    },
    "玻璃": {
        0: {"石材": 2},
    },
    "钻石": {
        0: {"金伯利矿石": 0.5}, 
    },
    "晶格硅": {
        0: {"硅块": 1},
    },
    "塑料": {
        0: {"精炼油": 2, "石墨": 1}
    },
    "石墨烯": {
        0: {"可燃冰-矿机": 1},
    },
    "电路板": {
        0: {"铜块": 0.5, "铁块": 1},
    },
    "马达": {
        0: {"铁块": 2, "齿轮": 1, "线圈": 1}
    },
    "微晶原件": {
        0: {"铜块": 1, "硅块": 2},
    },
    "绿管": {
        0: {"紫管": 2, "铁块": 2, "重氢-轨道采集器": 10},
    },
    "钛晶石": {
        0: {"钛块": 3, "有机晶体": 1},
    },
    "碳纳米管": {
        0: {"钛块": 0.5, "石墨烯": 1.5},
    },
    "粒子宽带": {
        0: {"碳纳米管": 2, "晶格硅": 2, "塑料": 1},
    },
    "齿轮": {
        0: {"铁块": 1},
    },
    "绿马达": {
        0: {"马达": 2, "线圈": 2}
    },
    "金cpu": {
        0: {"电路板": 2, "微晶原件": 2},
    },
    "卡西米尔晶体": {
        0: {"钛晶石": 1, "石墨烯": 2, "氢-轨道采集器-气巨": 12},
        1: {"光栅石": 8, "石墨烯": 2, "氢-轨道采集器-气巨": 12}
    },
    "钛玻璃": {
        0: {"玻璃": 1, "钛块": 1, "水": 1}
    },
    "位面过滤器": {
        0: {"卡西米尔晶体": 1, "钛玻璃": 2}
    },
    "蓝cpu": {
        0: {"金cpu": 2, "位面过滤器": 2}  
    },
    "紫管": {
        0: {"绿马达": 2, "铜块": 2, "石墨烯": 2}
    },
    "引力透镜": {
        0: {"钻石": 4, "绿管": 1},
    },
    "蓝糖": {
        0: {"线圈": 1, "电路板": 1},
    },
    "红糖": {
        0:{"氢-轨道采集器-气巨": 2, "石墨": 2},
    },
    "黄糖": {
        0: {"钻石": 1, "钛晶石": 1},
    },
    "紫糖": {
        0: {"粒子宽带": 1, "金cpu": 2},
    },
    "绿糖": {
        0: {"引力透镜": 0.5, "蓝cpu": 0.5}
    },
    "白糖": {
        0: {"蓝糖": 1, "红糖": 1, "黄糖": 1, "紫糖": 1, "绿糖": 1, "反物质": 1}
    }
}
SELECTED_RECIPE = {
    "铁块": 0,
    "铜块": 0,
    "石材": 0,
    "磁铁": 0,
    "线圈": 0,
    
}